Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source1.tmx
Source language: en_us
Languages: ja

source: Creates an array containing the elements of a sequence.
ja: あるシーケンスの要素を含んでいる配列を作成します。

source: Creates an array from a column in a machine learning data table.
ja: 機械学習データテーブルの縦列から配列を作成します。

source: Creates an array from a data-value dictionary.
ja: 配列をデータ値辞書から作成します。

source: Creates an array from a dictionary wrapped in a data value.
ja: ある配列をあるデータ値の中にラップされる辞書から作成します。

source: Creates an array from a sequence wrapped in a data value.
ja: ある配列をあるデータ値の中にラップされるシーケンスから作成します。

source: Creates an array from an untyped column in a machine learning data table.
ja: 機械学習データテーブルの型無し縦列から配列を作成します。

source: Creates an array from the given array literal.
ja: 指定された配列リテラルから配列を作成します。

source: Creates an array with the specified capacity, then calls the given closure with a buffer covering the array’s uninitialized memory.
ja: 新しい配列をこの指定された収納能力で作成します、それから与えられたクロージャを、配列のもつ初期化されないメモリを含むバッファで呼び出します。

source: Creates an asynchronous sequence that concatenates the results of calling the given error-throwing transformation with each element of this sequence.
ja: ある非同期シーケンスを作成します、それは与えられたエラースロー変換をこのシーケンスの各要素で呼び出すことの結果を連結します。

source: Creates an asynchronous sequence that concatenates the results of calling the given transformation with each element of this sequence.
ja: ある非同期シーケンスを作成します、それは与えられた変換をこのシーケンスの各要素で呼び出すことの結果を連結します。

source: Creates an asynchronous sequence that contains, in order, the elements of the base sequence that satisfy the given error-throwing predicate.
ja: ある非同期シーケンスを作成します、それは基底シーケンスの要素それらを、順番に含みます、それらは与えられたエラースロー述部を満たすものです。

source: Creates an asynchronous sequence that contains, in order, the elements of the base sequence that satisfy the given predicate.
ja: ある非同期シーケンスを作成します、それは基底シーケンスの要素それらを、順番に含みます、それらは与えられた述部を満たすものです。

source: Creates an asynchronous sequence that maps an error-throwing closure over the base sequence’s elements, omitting results that don’t return a value.
ja: ある非同期シーケンスを作成します、それはあるエラースロークロージャを基底シーケンスのもつ要素のすべてにわたってマップします、値を返さない結果を省きます。

source: Creates an asynchronous sequence that maps the given closure over the asynchronous sequence’s elements, omitting results that don’t return a value.
ja: ある非同期シーケンスを作成します、それは与えられたクロージャを非同期シーケンスのもつ要素のすべてにわたってマップします、値を返さない結果を省きます。

source: Creates an asynchronous sequence that maps the given closure over the asynchronous sequence’s elements.
ja: ある非同期シーケンスを作成します、それは与えられたクロージャを非同期シーケンスのもつ要素のすべてにわたってマップします。

source: Creates an asynchronous sequence that maps the given error-throwing closure over the asynchronous sequence’s elements.
ja: ある非同期シーケンスを作成します、それは与えられたエラースロークロージャを非同期シーケンスのもつ要素のすべてにわたってマップします。

source: Creates an empty dictionary with preallocated space for at least the specified number of elements.
ja: 空の辞書を、あらかじめアロケートされたスペースで少なくとも指定された要素数に対して作成します。

source: Creates an empty dictionary.
ja: 空の辞書を作成します。

source: Creates an instance containing just the given element.
ja: 与えられた要素だけを含んでいるインスタンスを作成します。

source: Creates an instance equal to the given Boolean value.
ja: 与えられたブール値と同じインスタンスを作成します。

source: Creates an instance equivalent to the given Range.
ja: 与えられたRangeと等しいインスタンスを作成します。

source: Creates an instance from a string interpolation.
ja: ある文字列補間からインスタンスを作成します。

source: Creates an instance initialized to false.
ja: falseに初期化されるインスタンスを作成します。

source: Creates an instance initialized to the given Boolean value.
ja: 与えられたブール値に初期化されるインスタンスを作成します。

source: Creates an instance initialized to the given string value.
ja: 与えられた文字列値へ初期化されるインスタンスを作成します。

source: Creates an instance initialized to the given value.
ja: 与えられた値に初期化されるインスタンスを作成します。

source: Creates an instance initialized to the specified Boolean literal.
ja: 指定されたブールリテラルに初期化されるインスタンスを作成します。

source: Creates an instance initialized to the specified floating-point value.
ja: 指定された浮動小数点値に初期化されるインスタンスを作成します。

source: Creates an instance initialized to the specified integer value.
ja: 指定された整数値に初期化されるインスタンスを作成します。

source: Creates an instance initialized with nil.
ja: nilで初期化されるインスタンスを作成します。

source: Creates an instance initialized with the given elements.
ja: 与えられた要素で初期化されるインスタンスを作成します。

source: Creates an instance initialized with the given key-value pairs.
ja: 与えられた「キー値」ペアで初期化されるインスタンスを作成します。

source: Creates an instance of the drop-while sequence iterator.
ja: drop-whileシーケンスイテレータのあるインスタンスを作成します。

source: Creates an instance with the given bounds.
ja: 与えられた境界を使ってインスタンスを作成します。

source: Creates an instance.
ja: １つのインスタンスを作成します。

source: Creates an integer from another integer wrapped in a data value.
ja: ある整数をデータ値の中にラップされる別の整数から作成します。

source: Creates an integer from its big-endian representation, changing the byte order if necessary.
ja: それのビッグエンディアン表現から整数を作成します、必要ならばバイト順を変更します。

source: Creates an integer from its little-endian representation, changing the byte order if necessary.
ja: それのリトルエンディアン表現から整数を作成します、必要ならばバイト順を変更します。

source: Creates an integer from the given floating-point value, if it can be represented exactly.
ja: 与えられた浮動小数点値から整数を作成します、もしそれが正確に表現可能ならば。

source: Creates an integer from the given floating-point value, rounding toward zero.
ja: 与えられた浮動小数点値から整数を作成します、ゼロへの丸めを行います。

source: Creates an integer that captures the full value of the given object identifier.
ja: 与えられたオブジェクト識別子の完全な値を捕獲する整数を作成します。

source: Creates an iterator that wraps a base iterator but whose type depends only on the base iterator’s element type.
ja: 基盤イテレータをラップするイテレータを作成します、しかしそれの型は基盤イテレータのもつ要素型にのみ影響を受けます。

source: Creates an iterator that wraps the given closure in its next() method.
ja: 与えられたクロージャをそれのnext()の中にラップするイテレータを作成します。

source: Creates the asynchronous iterator that produces elements of this asynchronous sequence.
ja: 非同期イテレータを作成します、それはこの非同期シーケンスの要素を取り出すものです。

source: Creating a Binary Integer
ja: ２進整数を作成する

source: Creating a Boolean From Another Value
ja: 別の値からあるブールを作成する

source: Creating a Character
ja: ある文字を作成する

source: Creating a Dictionary
ja: 辞書の作成

source: Creating a Dictionary from an Attribute Container
ja: 辞書を属性コンテナから作成する

source: Creating a Hasher
ja: ハーシャーを作成する

source: Creating a Random Integer
ja: 無作為な整数を作成する

source: Creating a Random Value
ja: 無作為な値を作成する

source: Creating a Range
ja: 範囲を作成する

source: Creating a Range Expression
ja: 範囲式を作成する

source: Creating a Type That Supports Custom String Interpolation
ja: あつらえの文字列補間をサボートする型を作成する

source: Creating a Type That Supports the Default String Interpolation
ja: 省略時の文字列補間をサポートする型を作成する

source: Creating an Array
ja: 配列の作成

source: Creating an Iterator
ja: イテレータを作成する

source: Creating and Applying Differences
ja: 差異の作成と適用

source: Custom Encoding and Decoding
ja: カスタムエンコーディングとデコーディング

source: Customize NSObject Subclass Behavior
ja: NSObjectサブクラス挙動をカスタマイズする

source: Customizing Your Type's Reflection
ja: あなたの型のリフレクションのカスタマイズ

source: Data Flow and Control Flow
ja: データの流れと制御の流れ

source: Data Modeling
ja: データモデリング

source: Debugging and Reflection
ja: デバッグとリフレクション

source: Decide how to store data and model behavior.
ja: どのようにデータを格納して挙動をモデル化するか決定を下します。

source: Decimal floating-point types admit a large number of non-canonical encodings.
ja: 10進浮動小数点型は、多数の非正準エンコーディングを認めます。

source: Declaration
ja: 宣言

source: Declarations marked with the private or fileprivate modifier don't appear in the generated header, and aren't exposed to the Objective-C runtime unless they are explicitly marked with a @IBAction, @IBOutlet, or @objc attribute.
ja: privateまたはfileprivate修飾子で印された宣言は生成されたヘッダに現れません、そしてObjective-Cランタイムに露出されません、それらが明示的に@IBAction、@IBOutlet、または@objc属性で印されない限りは。

source: Declaring Iterator Topography
ja: イテレータの構造的特徴を宣言する

source: Declaring conformance to the CVarArg protocol for types defined outside the standard library is not supported.
ja: 標準ライブラリ外で定義される型に対してCVarArgプロトコルへの準拠を宣言することは、サポートされません。

source: Default Implementations
ja: 省略時実装

source: Default Literal Types
ja: 省略時のリテラル型

source: Define an Observer
ja: オブザーバを定義する

source: Delegate methods can customize how an app responds to an event.
ja: 委任先メソッドは、どのようにアプリがイベントに応答するかをカスタマイズできます。

source: Depending on the size and span of range, some concrete values may be represented more frequently than others.
ja: rangeの大きさと幅に依存して、いくつかの具体的な値は他のものよりずっと頻繁に表現されるかもしれません。

source: Deprecated
ja: 非推奨

source: Describing a Boolean
ja: ブールを記述する

source: Describing a Character
ja: ある文字の説明

source: Describing a Dictionary
ja: ある辞書の記述

source: Describing a Double
ja: あるDoubleの記述

source: Describing a Float
ja: Floatを記述する

source: Describing a Range
ja: 範囲を記述する

source: Describing an Array
ja: 配列を記述する

source: Describing an Error
ja: エラーを記述する

source: Describing an Integer
ja: 整数を記述する

source: Diagram showing the steps to import Objective-C declarations into Swift code.
ja: 図はObjective-C宣言をSwiftコードにインポートする行程を示します。

source: Dictionaries are empty when created with an initializer or an empty dictionary literal.
ja: 辞書は、イニシャライザまたは空の辞書リテラルで作成した場合は空です。

source: Dictionary has two subscripting interfaces:
ja: 辞書は２つの添え字インターフェイスを持ちます：

source: Digest Implementations
ja: 要約実装

source: Discussion
ja: 解説

source: Divides the first value by the second and stores the quotient in the left-hand-side variable, rounding to a representable value.
ja: 最初の値を２番目の値で除算して、商を左手側の変数に格納します、表現可能な値へ丸められます。

source: Divides the first value by the second and stores the quotient in the left-hand-side variable.
ja: 最初の値を２番目の値で除算して、商を左手側の変数に格納します。

source: Divides the first value by the second and stores the remainder in the left-hand-side variable.
ja: 最初の値を２番目の値で除算して、余りを左手側の変数に格納します。

source: Dividing by zero is not an error when using this method.
ja: ゼロによる除算は、このメソッドを使う場合はエラーではありません。

source: Do not call this initializer directly.
ja: このイニシャライザを直接に呼ばないでください。

source: Do not call this method directly.
ja: このメソッドを直接に呼ばないでください。

source: Do not create an instance of this type directly.
ja: この型のインスタンスを直接に作成しないでください。

source: Do not escape it from the closure for later use.
ja: それを後で使うためにクロージャから脱出させないでください。

source: Do not rely on AnyHashable generating such compatible hashes, as the hash encoding that it uses may change between any two releases of the standard library.
ja: AnyHashableがこのような比較可能ハッシュを生成することを当てにしないでください、それが使うハッシュ符号化が標準ライブラリの何らかの２つのリリースの間に変化するかもしれないので。

source: Do not rely on a previously stored index value after altering a collection with any operation that can change its length.
ja: あるコレクションをそれの長さを変える何らかの演算で手直し後に、以前に格納されたインデックス値を当てにしないでください。

source: Do not rely on anything about the array that is the target of this method during execution of the body closure; it might not appear to have its correct value.
ja: このメソッドのターゲットである配列についてbodyクロージャの実行の間に何であれ依存しないでください：それは、それの正しい値を持つように見えないでしょう。

source: Do not save hash values to use during a future execution.
ja: 将来の実行の間に使うためにハッシュ値を保存しないでください。

source: Do not save or otherwise reuse hash values across executions of your program.
ja: あなたのプログラムの実行それらにまたがってハッシュ値を保存または別なふうに再利用しないでください。

source: Do not store or return the pointer for later use.
ja: 後で使うためにポインタを格納したり返したりしないでください。

source: Do not use unsafeBitCast(_:to:) with class or pointer types; doing so may introduce undefined behavior.
ja: unsafeBitCast(_:to:)をクラスまたはポインタ型で使わないでください；そうすることは未定義挙動を導きます。

source: Do not use this subscript to modify dictionary values if the dictionary’s Value type is a class.
ja: この添え字を使って、辞書値を修正しないでください、もしその辞書の持つValue型がクラスであるならば。

source: Doesn’t check for cancellation, and always executes the passed operation.
ja: 取り消しを調べないでください、そして常に渡されたoperationを遂行してください。

source: Doing so may become a compile-time error in the future.
ja: そうすることは、コンパイル時エラーに将来はなるかもしれません。

source: Don’t call this initializer directly.
ja: このイニシャライザを直に呼ばないでください。

source: Don’t expect any particular ordering of key-value pairs.
ja: 何らかの特定のキー値ペア順番付けを当てにしないでください。

source: Don’t store an unsafe task handle for use outside this method’s closure.
ja: 非安全タスクハンドルをこのメソッドのもつクロージャの外側で使うために格納しないでください。

source: Don’t use the equal-to operator (==) to test whether a value is NaN.
ja: 同等演算子（==を使ってある値がNaNかどうかをテストしないでください。

source: Don’t use this property to check whether a floating point value is negative.
ja: このプロパティを使って浮動小数点値が負かどうか調べないでください。

source: Downcast Objects to Call Methods and Access Properties
ja: オブジェクトをダウンキャストしてメソッドの呼び出しおよびプロパティにアクセスする

source: Dumps the given object’s contents using its mirror to standard output.
ja: 与えられたオブジェクトの内容をそれのミラーを使って標準出力にダンプします。

source: Dumps the given object’s contents using its mirror to the specified output stream.
ja: 与えられたオブジェクトの内容をそれのミラーを使って指定出力ストリームにダンプします。

source: During the registration period, you need to add and remove names as students add and drop the class.
ja: 履修期間の間、あなたはそのクラスに生徒を加えたり落としたりするたびに名前を加えたり取り除いたりする必要があります。

source: Dynamic Sequences
ja: 動的なシーケンス

source: Each array has an independent value that includes the values of all of its elements.
ja: 各配列はひとつの独立した値を持ち、それはそれのいくらかある要素の値すべてを含んでいます。

source: Each element of the result is the maximum of the corresponding elements of the inputs.
ja: 結果の各要素は、入力の対応する要素それらの最大です。

source: Each element of the result is the minimum of the corresponding elements of the inputs.
ja: 結果の各要素は、入力の対応する要素それらの最小です。

source: Each entry in the table is identified using its key, which is a hashable type such as a string or number.
ja: そのテーブル（表）の中の登録項目はそれのキーを使って特定され、そのキーはハッシュ化型、例えば文字列や数などです。

source: Each floating-point type has its own possible range and precision.
ja: 各浮動小数点型は、それ独自の可能な範囲と精度を持ちます。

source: Each key in elements must be unique.
ja: 各キーはelementsにおいて特有でなければなりません。

source: Each key in the keys collection has a unique value.
ja: このキーコレクションの中の各キーは、特有な値を持ちます。

source: Each value in the sequence is separated by stride.
ja: このシーケンスの各値は、strideによって隔てられます。

source: Each value in the sequence steps by stride.
ja: このシーケンスの各値は、strideだけまたいで越えます。

source: Edit the bridging header to expose your Objective-C code to your Swift code:
ja: ブリッジヘッダを編集して、あなたのObjective-CコードをあなたのSwiftコードに露出してください：

source: Either true or false, randomly chosen with equal probability.
ja: trueまたはfalseのどちらか、等しい確率で無作為に選ばれます。

source: Elements are sorted in ascending order.
ja: 要素は昇順にソートされます。

source: Elements that are used to split the collection are not returned as part of any subsequence.
ja: コレクションを分割するのに使われる要素らは、どれかの下位シーケンスの一部として返されません。

source: Elements that are used to split the sequence are not returned as part of any subsequence.
ja: シーケンスを分割するのに使われる要素らは、どれかの下位シーケンスの一部として返されません。

source: Encoders and Decoders
ja: エンコーダとデコーダ

source: Encodes the contents of this dictionary into the given encoder.
ja: この辞書の内容を指定のエンコーダへとエンコードします。

source: Encodes the elements of this array into the given encoder in an unkeyed container.
ja: この配列の要素を指定されたエンコーダへとあるキー付けされないコンテナにおいてエンコードします。

source: Encodes the elements of this contiguous array into the given encoder in an unkeyed container.
ja: この隣接配列の要素をこの与えられたエンコーダへとキー付けされないコンテナにおいて符号化します。

source: Encodes the scalars of this vector into the given encoder in an unkeyed container.
ja: このベクターのスカラーそれらをこの与えられたエンコーダへとキー付けされないコンテナの中に符号化します。

source: Encodes this value into the given encoder.
ja: この値を与えられたエンコーダにエンコードします。

source: Encoding and Decoding
ja: エンコーディングとデコーディング

source: Encoding and Decoding Custom Types
ja: あつらえの型のエンコーディングとデコーディング

source: Encoding and Decoding Values
ja: 値をエンコードおよびデコードする

source: Encoding and Decoding a Range
ja: ある範囲を符号化そして復号する

source: Encoding, Decoding, and Serialization
ja: エンコード、デコード、そしてシリアライズ

source: End of Iteration
ja: 反復の終わり

source: Enumeration Case
ja: 列挙ケース

source: Enumeration Cases
ja: 列挙ケース

source: Enumerations
ja: 列挙

source: Equality and Ordering
ja: 同等性と順序

source: Equality implies substitutability—any two instances that compare equally can be used interchangeably in any code that depends on their values.
ja: 同等性は代替可能性を暗黙的に意味します—同等性を比較されるあらゆる２つのインスタンスは、それらの値に影響を受けるあらゆるコードにおいて入れ替えて使われることができます。

source: Equality is Separate From Identity
ja: 同等性は同一性と別個のものです

source: Equality is the inverse of inequality.
ja: 同等性は、不等性の裏返しです。

source: Equatable Requirements
ja: Equatable 要件

source: Errors and Exceptions
ja: エラーと例外

source: Essential components are those that contribute to the type’s implementation of Equatable.
ja: 本質的な構成要素は、その型のもつEquatableの実装に寄与するそれらです。

source: Evaluates a closure while ensuring that the given instance is not destroyed before the closure returns.
ja: あるクロージャを評価する一方で与えられたインスタンスがそのクロージャが返る前に破棄されないことを確実にします。

source: Evaluation of the || operator is one of the following:
ja: ||演算子の評価は、次のうちの１つです：

source: Evaluation of the && operator is one of the following:
ja: &&演算子の評価は、次のうちの１つです：

source: Even though the barrier guarantees that neither closure will escape the function, the async(execute:) method still requires that the closures passed be marked as @escaping, so the first version of the function does not compile.
ja: たとえこの障壁がどちらのクロージャも関数を脱出しないことを保証するとしても、async(execute:)メソッドは依然としてこれらの渡されるクロージャが@escapingとして印されることを要求します、それで最初のバージョンの関数はコンパイルしません。

source: Every Character instance is composed of one or more Unicode scalar values that are grouped together as an extended grapheme cluster.
ja: すべてのCharacterインスタンスは、１つの拡張書記素クラスタとして一緒にまとめられる１つの以上のユニコードスカラー値から構成されます。

source: Every array reserves a specific amount of memory to hold its contents.
ja: すべての配列はある特定の量のメモリを確保することでその内容を保持します。

source: Every dictionary is an unordered collection of key-value pairs.
ja: すべての辞書は、キー値ペアの順番付けられないコレクションです。

source: Every distinct value of the conforming type has a corresponding unique value of the RawValue type, but there may be values of the RawValue type that don’t have a corresponding value of the conforming type.
ja: 準拠する型のすべての個々の値は、RawValue型の対応する特有な値を持ちます、しかし準拠する型の値に対応しないRawValue型の値があっても構いません。

source: Every element of numbers up to, but not including, the first negative value is included in the result.
ja: 最初の負の値までの、しかしそれを含まない、numbersのすべての要素は、この結果の中に含まれます。

source: Every key in keysAndValues must be unique.
ja: keysAndValuesの中のすべてのキーは特有でなければなりません。

source: Every value except NaN compares less than or equal to +infinity.
ja: NaNを除くあらゆる値は、+infinityより少ないか等しいと比較されます。

source: Every value except for NaN and +infinity compares less than +infinity.
ja: NaNと+infinityを除くあらゆる値は、+infinityより少ないと比較されます。

source: Exact Conversion
ja: 厳密変換

source: Example:
ja: 例：

source: Exceptional values need not take part in the strict total order.
ja: それら普通でない値は、全順序において役割を果たすには及びません。

source: Exchanges the values at the specified indices of the collection.
ja: そのコレクションの指定インデックスでの値を交換します。

source: Exchanges the values of the two arguments.
ja: ２つの引数の値を交換します。

source: Excluding Elements
ja: 要素を除外する

source: Execute an operation with a cancellation handler that’s immediately invoked if the current task is canceled.
ja: 現在のタスクが取り消されるならば直ちに発動されるある取り消しハンドラを備えた操作を遂行します。

source: Existential Types
ja: 存在型

source: Exiting a Program
ja: プログラムの終了

source: Expanding this set to include types that represent more than simple Boolean values is discouraged.
ja: 単純なブール値より多く表現する型を含めるためにこの集合を拡大することは推奨されません。

source: Expected Performance
ja: 期待される性能

source: Explicit construction from an UnsafeMutablePointer.
ja: UnsafeMutablePointerからの明示的な組み立て。

source: Exponent
ja: 指数

source: Exposing nonvalue aspects of Equatable types other than class identity is discouraged, and any that are exposed should be explicitly pointed out in documentation.
ja: Equatable型の非値の面を露出することはクラス識別子を除いて推奨されません、そして露出されるものは何でも、明白に文書において指摘されるべきです。

source: ExpressibleByExtendedGraphemeClusterLiteral Implementations
ja: ExpressibleByExtendedGraphemeClusterLiteral実装

source: ExpressibleByStringInterpolation Implementations
ja: ExpressibleByStringInterpolation 実装

source: ExpressibleByStringLiteral Implementations
ja: ExpressibleByStringLiteral実装

source: Extending default string interpolation behavior
ja: 省略時の文字列補間挙動を拡張する

source: Extending the Default Interpolation Behavior
ja: 省略時の補間挙動を拡張する

source: Failure to satisfy that assumption is a serious programming error.
ja: 了解事項を満たすことの失敗は、重大なプログラミングエラーです。

source: Finalizes the hasher state and returns the hash value.
ja: ハーシャー状態をファイナライズしてハッシュ値を返します。

source: Finalizing a Hasher
ja: ハーシャーをファイナライズする

source: Finalizing consumes the hasher: it is illegal to finalize a hasher you don’t own, or to perform operations on a finalized hasher.
ja: ファイナライズすることは、ハーシャーを消費します：あなたが所有者でないハーシャーをファイナライズすること、またはファイナライズされたハーシャー上で演算を実行することは不正です。

source: Finally, report the average temperature and observation counts:
ja: 最後に、平均温度と観測数を報告します：

source: Finding Elements
ja: 要素を見つける

source: Finding the Dynamic Type in a Generic Context
ja: 総称体の文脈において動的型を見つける

source: Finding the Sign and Magnitude
ja: 符号と規模を見つける

source: First Steps
ja: 初歩

source: First, a set of observations in Celsius is parsed from strings to Double values:
ja: まず、摂氏での観測の一揃いは、文字列からDouble値へ解析されます：

source: First, retrieve a sequence’s iterator, and then call the iterator’s next() method until it returns nil.
ja: まず、あるシーケンスのもつイテレータを見つけて取ってきてください、そしてそのイテレータの持つnext()メソッドを、それがnilを返すまで呼び出してください。

source: FixedWidthInteger Implementations
ja: 固定長整数実装

source: Floating Point
ja: 浮動小数点

source: Floating-Point Operators for Double
ja: Double用の浮動小数点演算

source: Floating-Point Operators for Float
ja: Float用の浮動小数点演算

source: Floating-Point Type Aliases
ja: 浮動小数点型エイリアス

source: Floating-Point Values
ja: 浮動小数点値

source: Floating-point types are used to represent fractional numbers, like 5.5, 100.0, or 3.14159274.
ja: 浮動小数点型は、5.5、100.0、または3.14159274のような、小数を表すために使われます。

source: Floating-point types represent values that are neither finite numbers nor infinity as NaN, an abbreviation for “not a number.” Comparing a NaN with any value, including another NaN, results in false.
ja: 浮動小数点型は、有限数でも無限大でもない値を「not a number」の略語、NaNで表します。NaNを別のNaNを含む何らかの値と比較することは、falseの結果になります。

source: Floating-point values are represented as a sign and a magnitude, where the magnitude is calculated using the type’s radix and the instance’s significand and exponent.
ja: 浮動小数点値は、符号と規模として表されます、そこにおいて規模はその型のもつ基数とインスタンスの仮数と指数を使って計算されます。

source: FloatingPoint Implementations
ja: 浮動小数点実装

source: For nan or -infinity, x.nextDown is x itself.
ja: nanまたは-infinityに対して、x.nextDownはxそれ自身です。

source: For nan or infinity, x.nextUp is x itself.
ja: nanまたはinfinityに対して、x.nextUpはxそれ自身です。

source: For Foundation types that aren't bridged to value types, the Swift overlay renames classes and protocols, as well as related enumerations and constants.
ja: 値型にブリッジされないFoundation型に対して、Swiftオーバーレイはクラスとプロトコルを改名します、それだけでなく関連する列挙と定数も。

source: For NaN, both isFinite and isInfinite are false.
ja: NaNに対して、isFiniteおよびisInfiniteは、falseです。

source: For a struct, all its stored properties must conform to Equatable.
ja: structに対して、すべてのそれの格納プロパティはEquatableに準拠しなければなりません。

source: For a struct, all its stored properties must conform to Hashable.
ja: structに対して、すべてのそれの格納プロパティはHashableに準拠しなければなりません。

source: For a structure, all its stored properties must conform to Equatable and Hashable.
ja: 構造体に対して、全てのそれの格納プロパティは、EquatableおよびHashableに準拠しなければなりません。

source: For a type F, positive and negative infinity are represented as F.infinity and -F.infinity, respectively.
ja: 型Fに対して、正と負の無限大はそれぞれF.infinityと-F.infinityのように表されます。

source: For a type T, the resulting value is in the range T.min...T.max.
ja: 型Tに対して、結果となる値は範囲T.min...T.maxの中です。

source: For a value x, a distance n, and a value y = x.advanced(by: n), x.distance(to: y) == n.
ja: 値x、隔たりn、および値y = x.advanced(by: n)に対して、x.distance(to: y) == n。

source: For a value x, the comparison x.sign == .minus is not necessarily the same as x < 0.
ja: 値xに対して、比較x.sign == .minusは必ずしもx < 0と同じではありません。

source: For a value x, the result of x.dividedReportingOverflow(by: 0) is (x, true).
ja: 値xに対して、x.dividedReportingOverflow(by: 0)の結果は(x, true)です。

source: For a value x, the result of x.remainderReportingOverflow(dividingBy: 0) is (x, true).
ja: 値xに対して、x.remainderReportingOverflow(dividingBy: 0)の結果は(x, true)です。
